app/interactors/create_product.rb

  def call
    params = context.params
    uploaded_pictures = params[:data].values.map { |v| Cloudinary::Uploader.upload(v.path) } if params[:data]

    product = JSON.parse(params[:product])
    category = Category.find_by(name: product['category'])
    subcategory = Subcategory.find_by(category: category, name: product['subcategory'])
    product_new = Product.create!(
      name: product['name'],
      description: product['description'],
      kind: product['kind'],
      user_id: 1,
      category: category,
      subcategory: subcategory,
      status: 'unpublished'
    )
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "іграшки"], ["LIMIT", 1]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = $1 AND "subcategories"."name" = $2 LIMIT $3  [["category_id", 2], ["name", "мякі"], ["LIMIT", 1]]
INSERT INTO "products" ("name", "description", "created_at", "updated_at", "kind", "category_id", "subcategory_id", "user_id", "status", "url_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"