app/controllers/Api/categories_controller.rb

  def index
    categories = Category.includes(:subcategories).map do |c|
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2, $3, $4, $5)  [[nil, 2], [nil, 5], [nil, 1], [nil, 3], [nil, 4]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16)  [[nil, 15], [nil, 35], [nil, 10], [nil, 24], [nil, 16], [nil, 21], [nil, 31], [nil, 23], [nil, 11], [nil, 37], [nil, 36], [nil, 20], [nil, 32], [nil, 34], [nil, 9], [nil, 14]]