app/controllers/api/categories_controller.rb

  def index
    categories = Category.includes(:subcategories).map do |c|
---
SELECT "categories".* FROM "categories"
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" IN ($1, $2, $3, $4, $5)  [[nil, 1], [nil, 2], [nil, 3], [nil, 4], [nil, 5]]