app/controllers/Api/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "product_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "i am comment"], ["created_at", "2021-04-04 19:31:13.993844"], ["updated_at", "2021-04-04 19:31:13.993844"], ["product_id", 97], ["user_id", 11]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]
INSERT INTO "notifications" ("body", "kind", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    json = params.require(:comment).permit(:body, :rating, :product_id).to_h
    json.merge!(user_id: current_user.id)
    comment = Comment.create(json)
    product = Product.find(params[:product_id])

    Notification.create(body: "#{current_user.email} прокоментував  Вашу річ #{product.name}", user: product.user, kind: 'comment', status: 'new' )

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "i am comment editable"], ["updated_at", "2021-04-04 19:44:34.854282"], ["id", 1]]
---
  def update
    json = params.require(:comment).permit(:body, :rating, :id)
    comment = Comment.find(json[:id])
    comment.update(json) if comment.user_id == current_user.id

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def destroy
    Comment.destroy(params[:id]) if Comment.find(params[:id]).user_id == current_user.id