app/controllers/Api/notifications_controller.rb

  def index
    notifications = current_user.notifications.order(created_at: :desc)

    render json: { notifications: notifications.map {|notification| notification.attributes.merge(created_date: notification.created_at.strftime('%d-%m-%Y'))}}
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 ORDER BY "notifications"."created_at" DESC  [["user_id", 12]]

  def update
    current_user.notifications.update_all(status: 'viewed')
---
UPDATE "notifications" SET "status" = $1 WHERE "notifications"."user_id" = $2  [["status", "viewed"], ["user_id", 12]]