app/controllers/Api/products_controller.rb

  def show
    product = Product.find_by(url_name: params[:name])
    comments_arr = product.comments.map { |c| { id: c.id, body: c.body, email: c.user.email } }

    render json: {
      product: product.attributes.merge(
        category: product.category.name,
        subcategory: product.subcategory.name,
        images: product.images.pluck(:url),
        user: product.user.email
      ),
      comments: comments_arr
---
SELECT "products".* FROM "products" WHERE "products"."url_name" = $1 LIMIT $2  [["url_name", "blaha"], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = $1  [["product_id", 108]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "images"."url" FROM "images" WHERE "images"."product_id" = $1  [["product_id", 108]]

  def wanna_thing
    product = Product.find(params[:id])
    UserMailer.with(user_email: current_user.email, product: product).proposal_email.deliver_now

    body = "#{current_user.email} хоче отримати  Вашу річ #{product.name}"
    Notification.create(body: body, user: product.user, kind: 'proposal', status: 'new' )
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
INSERT INTO "notifications" ("body", "kind", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def thing_to_change
    product = Product.find(params[:id])
    product_change = Product.find(params[:change_id])
    UserMailer.with(user_email: current_user.email, product: product, product_change: product_change).proposal_email.deliver_now

    body = "#{current_user.email} хоче обміняти Вашу #{product.name} на #{ product_change.name }"
    Notification.create(body: body, user: product.user, kind: 'proposal', status: 'new' )
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 108], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]
INSERT INTO "notifications" ("body", "kind", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"