app/controllers/api/profile_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [[nil, 2], [nil, 1]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."id" IN ($1, $2)  [[nil, 11], [nil, 1]]
SELECT "images".* FROM "images" WHERE "images"."product_id" IN ($1, $2)  [[nil, 104], [nil, 105]]
SELECT "products".* FROM "products" WHERE "products"."status" = $1 AND "products"."kind" = $2 AND "products"."user_id" = $3  [["status", "published"], ["kind", "подарую"], ["user_id", 12]]
---
  def find_products(user)
    products = Product.where(status: params[:status], kind: params[:kind].to_s.split(','), user: user).includes(
      :category, :subcategory, :images
    ).map do |product|