app/controllers/Api/profile_controller.rb

  def products
    products = Product.where(status: params[:status], kind: params[:kind].to_s.split(','), user: current_user ).includes(
      :category, :subcategory, :images).map do |product|
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [[nil, 2], [nil, 1]]
SELECT "images".* FROM "images" WHERE "images"."product_id" IN ($1, $2)  [[nil, 101], [nil, 103]]
SELECT "products".* FROM "products" WHERE "products"."status" = $1 AND "products"."kind" IN ($2, $3) AND "products"."user_id" = $4  [["status", "unpublished"], [nil, "подарую"], [nil, "обміняю"], ["user_id", 11]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."id" IN ($1, $2)  [[nil, 11], [nil, 1]]