app/controllers/api/telegram_controller.rb

  def telegram_webhook
    user = User.find_by(email: params[:email])
    user.update(telegram_chat_id: params[:chat_id]) if user.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "vetal.tarasenko@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "vetal.tarasenko@gmail.com"], ["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "telegram_chat_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-05-05 05:21:55.622313"], ["telegram_chat_id", 128077509], ["id", 1]]